Repository: mozammal-hossain/45df8818c9fb
Catalog: device_vital_monitor_flutter_app/lib/l10n/app_*.arb
Languages: bn

# appTitle
source: Device Vital Monitor
bn: ডিভাইস ভাইটাল মনিটর

# toggleThemeTooltip
source: Toggle light / dark / system theme
bn: লাইট / ডার্ক / সিস্টেম থিম টগল করুন

source: Thermal State
bn: তাপীয় অবস্থা

# thermalStateNone
source: NONE
bn: কোনও নেই

# thermalStateLight
source: LIGHT
bn: হালকা

# thermalStateModerate
source: MODERATE
bn: মাঝারি

# thermalStateSevere
source: SEVERE
bn: গুরুতর

# thermalStateUnknown
source: UNKNOWN
bn: অজানা

# thermalDescriptionNone
source: System operating within normal temperature ranges.
bn: সিস্টেম স্বাভাবিক তাপমাত্রার মধ্যে চলছে।

# thermalDescriptionLight
source: Slightly elevated temperature, monitoring recommended.
bn: হালকা উত্তাপ, পর্যবেক্ষণ সুপারিশ করা হয়।

# thermalDescriptionModerate
source: Moderate thermal stress detected. Consider reducing usage.
bn: মাঝারি তাপীয় চাপ সনাক্ত। ব্যবহার কমানোর বিবেচনা করুন।

# thermalDescriptionSevere
source: Severe thermal condition. Device may throttle performance.
bn: গুরুতর তাপীয় অবস্থা। ডিভাইস পারফরম্যান্স সীমিত করতে পারে।

# thermalDescriptionUnavailable
source: Thermal state unavailable.
bn: তাপীয় অবস্থা উপলব্ধ নয়।

source: Loading thermal state...
bn: তাপীয় অবস্থা লোড হচ্ছে...

source: Battery Level
bn: ব্যাটারি লেভেল

# batteryStatusHealthy
source: HEALTHY
bn: স্বাস্থ্যকর

# batteryStatusModerate
source: MODERATE
bn: মাঝারি

# batteryStatusLow
source: LOW
bn: নিচু

# batteryStatusCritical
source: CRITICAL
bn: সমালোচনামূলক

# batteryStatusLoading
source: LOADING
bn: লোড হচ্ছে

# estimatedTimeRemaining
source: Estimated {hours}h remaining
bn: আনুমানিক {hours}ঘণ্টা বাকি

# deviceHealthLabel
source: Device health: {health}
bn: ডিভাইস স্বাস্থ্য: {health}

# chargerLabel
source: Charger: {connection}
bn: চার্জার: {connection}

# statusLabel
source: Status: {status}
bn: স্থিতি: {status}

# batteryHealthGood
source: Good
bn: ভালো

# batteryHealthOverheat
source: Overheat
bn: অতিরিক্ত গরম

# batteryHealthDead
source: Dead
bn: মৃত

# batteryHealthOverVoltage
source: Over voltage
bn: ওভার ভোল্টেজ

# batteryHealthUnspecifiedFailure
source: Unspecified failure
bn: অনির্দিষ্ট ব্যর্থতা

# batteryHealthCold
source: Cold
bn: ঠান্ডা

# chargerAc
source: AC Charger
bn: এসি চার্জার

# chargerUsb
source: USB
bn: ইউএসবি

# chargerWireless
source: Wireless
bn: ওয়্যারলেস

# chargerNone
source: Not connected
bn: সংযুক্ত নয়

# batteryCharging
source: Charging
bn: চার্জ হচ্ছে

# batteryDischarging
source: Discharging
bn: ডিসচার্জ হচ্ছে

# batteryFull
source: Full
bn: পূর্ণ

# batteryNotCharging
source: Not charging
bn: চার্জ হচ্ছে না

# batteryUnknown
source: Unknown
bn: অজানা

source: Memory Usage
bn: মেমরি ব্যবহার

# memoryCritical
source: Critical
bn: সমালোচনামূলক

# memoryHigh
source: High
bn: উচ্চ

# memoryModerate
source: Moderate
bn: মাঝারি

# memoryNormal
source: Normal
bn: স্বাভাবিক

# memoryOptimized
source: Optimized
bn: অপ্টিমাইজড

source: used
bn: ব্যবহৃত

source: loading…
bn: লোড হচ্ছে…

source: unavailable
bn: অপলব্ধ

source: Log Status Snapshot
bn: লগ স্ট্যাটাস স্ন্যাপশট

# historyTitle
source: History
bn: ইতিহাস

# historyEmpty
source: No vitals logged yet. Use “Log Status” on the dashboard.
bn: এখনও কোনো ভাইটাল লগ নেই। ড্যাশবোর্ডে "লগ স্ট্যাটাস" ব্যবহার করুন।

# analyticsTitle
source: Analytics (rolling window)
bn: বিশ্লেষণ

# averageThermalLabel
source: Avg thermal
bn: গড় তাপীয়

# averageBatteryLabel
source: Avg battery
bn: গড় ব্যাটারি

# averageMemoryLabel
source: Avg memory
bn: গড় মেমরি

# totalLogsLabel
source: Total logs
bn: মোট লগ

# rollingWindowLogsLabel
source: Logs in window
bn: উইন্ডোতে লগ

# dashboardTitle
source: Dashboard
bn: ড্যাশবোর্ড

# loggingEllipsis
source: Logging…
bn: লগ করা হচ্ছে…

# appSettingsTitle
source: App Settings
bn: অ্যাপ সেটিংস

# settingsSubtitle
source: Manage your preferences
bn: আপনার পছন্দসমূহ পরিচালনা করুন

# languageLabel
source: Language
bn: ভাষা

# languageBangla
source: Bangla
bn: বাংলা

# languageEnglish
source: English
bn: ইংরেজি

# themeLabel
source: Theme
bn: থিম

# themeLight
source: Light
bn: লাইট

# themeDark
source: Dark
bn: ডার্ক

# themeSystemDefault
source: System Default
bn: সিস্টেম ডিফল্ট

# settingsTitle
source: Settings
bn: সেটিংস

# versionBuild
source: Version {version} (Build {build})
bn: সংস্করণ {version} (বিল্ড {build})
